Работа_с_формами_в_управляемом_интерфейсе/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ПрофилиПользователей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ЦенаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСтроки</name>
      <type>
        <types>DefinedType.СуммаСтрокиДокумента</types>
      </type>
    </attributes>
    <attributes>
      <name>Отложить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Работа_с_формами_в_управляемом_интерфейсе/src/InformationRegisters/СтрокаВыбора/СтрокаВыбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтрокаВыбора</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Работа_с_формами_в_управляемом_интерфейсе/src/Documents/ЗаказКлиента/ManagerModule.bsl
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма,
		ДополнительнаяИнформация, СтандартнаяОбработка)

	НадоОпределитьПараметрСостав = Ложь;

	Если (ВидФормы = "ФормаОбъекта"
			И Параметры.Свойство("ЗначенияЗаполнения") = Истина
			И Параметры.ЗначенияЗаполнения.Свойство("Номенклатура")) Тогда
		НадоОпределитьПараметрСостав = Истина;

	КонецЕсли;

	Если (НадоОпределитьПараметрСостав = Истина) Тогда
		Параметры.ЗначенияЗаполнения.Вставить("Состав", Новый ТаблицаЗначений());
		Параметры.ЗначенияЗаполнения.Состав.Колонки.Добавить("Номенклатура");

		Для Каждого Номенклатура Из Параметры.ЗначенияЗаполнения.Номенклатура Цикл
			ДанныеСостава = Параметры.ЗначенияЗаполнения.Состав.Добавить();
			ДанныеСостава.Номенклатура = Номенклатура;
		КонецЦикла;

		Параметры.ЗначенияЗаполнения.Удалить("Номенклатура");
	КонецЕсли;

	Если (ВидФормы = "ФормаОбъекта"
			И Параметры.Свойство("ЗначенияЗаполнения") = Истина
			И Параметры.ЗначенияЗаполнения.Свойство("Состав")
			И Параметры.ЗначенияЗаполнения.Состав = Неопределено) Тогда
		
		Параметры.ЗначенияЗаполнения.Состав = ДанныеОбластиНоменклатура(Параметры.ЗначенияЗаполнения.Клиент)
		
	КонецЕсли;

КонецПроцедуры

Функция ДанныеОбластиНоменклатура(Клиент)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	СтрокаВыбора.Номенклатура,
		|	СтрокаВыбора.Количество
		|ИЗ
		|	РегистрСведений.СтрокаВыбора КАК СтрокаВыбора
		|ГДЕ
		|	СтрокаВыбора.Клиент = &Клиент";

	Запрос.УстановитьПараметр("Клиент", Клиент);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
